#不知道叫啥了，自己取名字吧

#计算机与程序设计


#计算机：功能性、可编程性
#功能性：对数据操作，表现为计算，输入出，处理，结果存储
#可变成性：根据指令自动的，可预测的准确的完成任务

#计算机根据摩尔定律预测 指数发展

#程序设计是计算机可编程性的体现

#程序设计语言：程序设计的具体方式，计算机语言不具备二义性
#1972年c语言诞生，1990年python诞生


#编程语言的执行方式
#编译与解释

#源代码：采用某种编程语言编写的计算机程序，人类可读 如：a = 1 + 1
#目标代码：计算机可直接执行 “普通人类”不可读 如：0101 0011

#程序执行的两种方式
#1.编译：将源代码一次性转换成目标代码的过程
#过程：源代码-->编译器-->目标代码-->程序执行+输入输出
#2.解释：将源代码逐条转换成目标代码，同时逐条运行的过程
#过程：源代码+程序输入-->解释器-->输出结果
#编译效率高，解释效率低

#静态语言：使用编译执行的编程语言 ：c/c++java
#脚本语言：使用解释执行的编程语言 ：python js php
#静态语言速度快，优化好
#脚本语言维护灵活，跨平台


#编写的基本方法
#ipo:I:input,P:process,O:output









