#程序框架

#代码高亮

#缩进：四个空格，缩进表达格式框架，是语法的一部分，表达代码的从属关系
#单行注释：用“#” 多行注释："""..."""    提高可读性

#命名与保留字

#变量：用于保存和表示数据的占位符号，如： a = 100 ，a为变量，
# 用等于号（赋值符号）“=”给变量赋值

#保留字：被编程语言内部定义并保留使用的标识符（33个）也叫关键字 ，大小写敏感
#33个是啥自己查，还指望我告诉你？

#命名：为变量关联标识符
#命名规则：大小写字母。数字，下划线，与汉字等字符，及组合
#命名：大小写敏感，首字符不能为数字，不予保留字相同


#数据类型：程序语言通过一定方式项计算机表达数据的形式，
# 使计算机程序理解数据形式

#字符串，整数，浮点数，列表......
#整数：使用整数表达：1，-1，2，3，...
#字符串：用单/双引号表达 ："这是一串字符"
#列表：用方括号：[10,011,"aaa"]
#浮点数：用小数表示：1.11，3.14
#整数与浮点数叫做数字类型


#字符串操作
#在字符串中字符从0开始编号
#序号索引体系：正向递增序号&反向递减序号
#正向：0，1，2，3，4，5，6，7，8，9
#反向：-...-9，-8，-7，-6，-5，-4，-3，-2，-1

#使用[]获取字符串中一个或多个字符
#索引：返回字符串中单个字符 <字符串>[M] M为序号
#切片：返回字符串中的一段字符 <字符串>[M:N] 取M到N（不取N）

#列表操作
#使用保留字in判断一个元素是否在列表中
#x in ["a","b"]--->False
#a in["a","b"]--->True




