"""
逻辑运算符：
and，or，not

X and Y：布尔"与" - 如果 x 为 False，x and y 返回 False，
否则它返回 y 的计算值。

X or Y  ：布尔"或" - 如果 x 是非 0，它返回 x 的值，
否则它返回 y 的计算值。

not X：布尔"非" - 如果 x 为 True，返回 False 。
如果 x 为 False，它返回 True。

不明白自己试代码
"""

"""
成员运算符
in：在指定序列中查找，找到返回真，未找到返回假
not in：在指定序列中查找，找到返回假，未找到返回真

"""

"""
位运算

&:按位与运算符：参与运算的两个值,
如果两个相应位都为1,则该位的结果为1,否则为0

|:按位或运算符：只要对应的二个二进位有一个为1时，
结果位就为1

^:按位异或运算符：当两对应的二进位相异时，结果为1

~:	按位取反运算符：对数据的每个二进制位取反,即把1变为0,把0变为1 。
~x 类似于 -x-1

<<:左移动运算符：运算数的各二进位全部左移若干位，
由 << 右边的数字指定了移动的位数，高位丢弃，低位补0。


>>:右移动运算符：把">>"左边的运算数的各二进位全部右移若干位，
>> 右边的数字指定了移动的位数

位运算化成二进制！！！
"""

